RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ipc_bt.c
/***************************************************************************//**
* \file cy_ipc_bt.c
* \version 1.80
*
* \brief
*  This driver provides the source code for BT IPC.
*
********************************************************************************
* \copyright
* Copyright (c) (2020-2022), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXIPC)

#include "cy_ipc_bt.h"

/* Should not include this. To be removed */
#include <string.h>

#include <stdio.h>

CY_MISRA_DEVIATE_BLOCK_START('ARRAY_VS_SINGLETON', 1, \
'Checked manually. Using pointer as an array will not corrupt or misinterpret adjacent memory locations.');

//#define BTIPC_DBG_L0
//#define BTIPC_DBG_L1
//#define BTIPC_DBG_L2
//#define BTIPC_STATUS

/** Buffer descriptor offset in the init message */
#ifndef BT_OLD_INIT
#define INIT_IPC_BUFF_DESC_OFFSET 5
#else
#define INIT_IPC_BUFF_DESC_OFFSET 1
#endif

#ifdef BTIPC_DBG_L0
#define BTIPC_LOG_L0(...)   printf(__VA_ARGS__)
#else
#define BTIPC_LOG_L0(...)
#endif

#ifdef BTIPC_DBG_L1
#define BTIPC_LOG_L1(...)   printf(__VA_ARGS__)
#else
#define BTIPC_LOG_L1(...)
#endif

#ifdef BTIPC_DBG_L2
#define BTIPC_LOG_L2(...)   printf(__VA_ARGS__)
#else
#define BTIPC_LOG_L2(...)
#endif

/* local functions prototype */
cy_en_btipcdrv_status_t Cy_bt_handle_hpclong_msg(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t * msgPtr);
cy_en_btipcdrv_status_t Cy_bt_handle_buf_add(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t * msgPtr);
static cy_en_btipc_buftype_t Cy_bt_get_buf_type(cy_en_btipc_hcipti_t pti);
static uint32_t Cy_bt_getPLLegnth(cy_en_btipc_hcipti_t pti, uint8_t* bufAddr);
static bool Cy_bt_isOffsetNeeded(cy_en_btipc_hcipti_t pti);
static cy_en_btipcdrv_status_t Cy_bt_GetBuffer (cy_stc_ipc_bt_context_t *btIpcContext, void **ppBuf, cy_en_btipc_buftype_t bufType, size_t length);
static cy_en_btipcdrv_status_t Cy_bt_PutBuffer(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_buf_t *bufDecriptor);
static cy_en_btipcdrv_status_t Cy_BTIPC_HCI_FIFOPut(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t *pMsg);
cy_en_btipcdrv_status_t Cy_BTIPC_HPC_RelBuffer(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t* msgPtr);

CY_IPC_SECTION_BEGIN
void Cy_BTIPC_IRQ_Handler(cy_stc_ipc_bt_context_t *btIpcContext)
{
    uint32_t shadowIntr;
    IPC_STRUCT_Type *ipcPtr;
    IPC_INTR_STRUCT_Type *ipcIntrPtr;
    uint32_t mesg[2], backup[2];
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint32_t notify;
    uint32_t release;
    uint32_t channelHCI;
    uint32_t channelHPC;
    uint8_t idx;
    cy_en_btipc_hpcpti_t msgType;

    if (NULL == contextPtr)
    {
        BTIPC_LOG_L0("Context ptr null\n");
        return;
    }

#ifdef CY_BTIPC_STATS
    contextPtr->ipc_int_count++;
#endif

    ipcIntrPtr = Cy_IPC_Drv_GetIntrBaseAddr(contextPtr->intStuctureSelf);
    shadowIntr = Cy_IPC_Drv_GetInterruptStatusMasked(ipcIntrPtr);

    notify = Cy_IPC_Drv_ExtractAcquireMask(shadowIntr);

    /* Check to make sure the interrupt was a release interrupt */
    release = Cy_IPC_Drv_ExtractReleaseMask(shadowIntr);

    BTIPC_LOG_L1("shadow 0x%lx, notifyMask 0x%lx, relMask 0x%lx\n", shadowIntr, notify, release);

    /* First process the release callback */
    if (0UL != release)  /* Check for a Release interrupt */
    {
        BTIPC_LOG_L1("Release int\n");
        /* Clear the release interrupt  */
        Cy_IPC_Drv_ClearInterrupt(ipcIntrPtr, release, CY_IPC_NO_NOTIFICATION);
#ifdef CY_BTIPC_STATS
        if ((release & (uint32_t)(0x1UL << contextPtr->ulChannelHPC)) != 0UL)
        {
            contextPtr->ipc_hpc_release_count++;
        }
        if ((release & (uint32_t)(0x1UL << contextPtr->ulChannelHCI)) != 0UL)
        {
            contextPtr->ipc_hci_release_count++;
        }
#endif
        /* release callback can be added here. */
        if ((contextPtr->ulReleaseCallbackPtr) != NULL )
        {
            contextPtr->ulReleaseCallbackPtr();
        }
    }

    /* Check to make sure the interrupt was a notify interrupt */
    if (0UL != notify)
    {
        BTIPC_LOG_L1("Notify int ");
        /* Clear the notify interrupt.  */
        Cy_IPC_Drv_ClearInterrupt(ipcIntrPtr, CY_IPC_NO_NOTIFICATION, notify);

        if ((notify & (uint32_t)(0x1UL << contextPtr->dlChannelHPC)) != 0UL)
        {
#ifdef CY_BTIPC_STATS
            contextPtr->ipc_hpc_notify_count++;
            if (contextPtr->ipc_hci_fifo_full > 0UL)
            {
                contextPtr->ipc_hci_notify_in_fifo_full++;
            }
#endif
            channelHPC = contextPtr->dlChannelHPC;

            BTIPC_LOG_L1("on ch %u\n",channelHPC);

            ipcPtr = Cy_IPC_Drv_GetIpcBaseAddress(channelHPC);
            Cy_IPC_Drv_ReadDDataValue(ipcPtr, mesg);
            /* Keep back up of mesg needed to release the buffer */
            backup[0] = mesg[0];
            backup[1] = mesg[1];

            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_btipc_hpcpti_t enum.');
            msgType = (cy_en_btipc_hpcpti_t)((0xFFUL) & mesg[0]);

            BTIPC_LOG_L1("HPC payload type %d\n",msgType);

            if ((contextPtr->internal_hpc_notify_cb) != NULL)
            {
                BTIPC_LOG_L1("Notify HPC int cb+\n");
                contextPtr->internal_hpc_notify_cb((void*)contextPtr, mesg);
                BTIPC_LOG_L1("Notify HPC int cb-\n");
            }
            for (idx = 0; idx < ((uint8_t)MAX_BT_IPC_HPC_CB); idx++)
            {
                BTIPC_LOG_L1("idx %d, Notify HPC cb %p, msgType %d\n",idx, contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr, contextPtr->hpcNotifyCallbackParam[idx].msgType);
                if ((contextPtr->hpcNotifyCallbackParam[idx].msgType == msgType) &&
                    (contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr != NULL))
                {
                   BTIPC_LOG_L1("Calling Notify HPC cb %p\n",contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr);
                    if ((msgType == CY_BT_IPC_HPC_LONG) && (*(((uint8_t*)mesg)+1) == (uint8_t)CY_BT_IPC_HPC_INIT))
                    {
                        /* Add Boot type to the message add pass it to the application */
                        *(((uint8_t*)mesg)+2) = contextPtr->bootType;
                        /* Certificate error field, so that the app can process if needed */
                        mesg[1] = contextPtr->certError;
                    }
                    contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr(mesg);
                }
            }
            /* Release channel for HPC message only */
            (void)Cy_BTIPC_HPC_RelChannel(contextPtr, backup); /* Suppress a compiler warning about unused return value */
#ifdef CY_BTIPC_STATS
            contextPtr->ipc_hpc_peer_release_count++;
#endif
            if (0xFFUL == (0xFFUL & mesg[0]))
            {
                (void)Cy_BTIPC_HPC_RelBuffer(contextPtr, backup); /* Suppress a compiler warning about unused return value */
            }
        }

        if ((notify & (uint32_t)(0x1UL << contextPtr->dlChannelHCI)) != 0UL)
        {
#ifdef CY_BTIPC_STATS
            contextPtr->ipc_hci_notify_count++;
#endif
            channelHCI = contextPtr->dlChannelHCI;

            BTIPC_LOG_L1("on ch %u\n",channelHCI);

