RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ipc_bt.c
            ipcPtr = Cy_IPC_Drv_GetIpcBaseAddress(channelHCI);
            Cy_IPC_Drv_ReadDDataValue(ipcPtr, mesg);
            /* Push the mesg to FIFO */
            if (((uint32_t)Cy_BTIPC_HCI_FIFOPut(contextPtr, mesg)) == 0UL)
            {
                if (((uint16_t)MAX_IPC_FIFO_SIZE) > Cy_BTIPC_HCI_FIFOCount(contextPtr))
                {
                    /* Release channel for HCI message only if FIFO is not full */
                    (void)Cy_BTIPC_HCI_RelChannel(contextPtr); /* Suppress a compiler warning about unused return value */
#ifdef CY_BTIPC_STATS
                    contextPtr->ipc_hci_peer_release_count++;
#endif
                }
                else
                {
                    contextPtr->ipc_hci_fifo_full++;
                    BTIPC_LOG_L0("\nFIFO is Full. Ch 0x%lx not released !\n",channelHCI);
                }
                BTIPC_LOG_L1("FIFO count %d\n",contextPtr->IpcFifo.bufLen);

                /* call the callback function */
                if ((contextPtr->dlNotifyCallbackPtr) != NULL)
                {

                    BTIPC_LOG_L1("Notify HCI cb\n");
                    contextPtr->dlNotifyCallbackPtr(mesg);
                }
            }
            else
            {
                BTIPC_LOG_L0("Error: Msg received after FIFO is full !\n");
                contextPtr->droppedHCI++;
                /* Add assert here */
                CY_ASSERT_L1(false);
                return;
            }
        }
    }
}
CY_IPC_SECTION_END

CY_IPC_SECTION_BEGIN
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_RelChannel(cy_stc_ipc_bt_context_t *btIpcContext)
{
    IPC_STRUCT_Type *ipcPtr;
    uint32_t rel_mask;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;

    if (NULL == contextPtr)
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    ipcPtr = Cy_IPC_Drv_GetIpcBaseAddress (contextPtr->dlChannelHCI);

    rel_mask = (uint32_t)(1UL << contextPtr->intStucturePeer);

    Cy_IPC_Drv_ReleaseNotify(ipcPtr, rel_mask);

    return CY_BT_IPC_DRV_SUCCESS;
}
CY_IPC_SECTION_END


cy_en_btipcdrv_status_t Cy_BTIPC_HPC_RelChannel(cy_stc_ipc_bt_context_t *btIpcContext, void * buf)
{
    IPC_STRUCT_Type *ipcPtr;
    uint32_t rel_mask;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    (void)buf;
    // Fix if this is causing issue
#if 1
    if ((NULL == contextPtr) || (NULL == buf))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }
#endif

    ipcPtr = Cy_IPC_Drv_GetIpcBaseAddress (contextPtr->dlChannelHPC);

    rel_mask = (uint32_t)(1UL << contextPtr->intStucturePeer);
    BTIPC_LOG_L1("Release %p, mask 0x%lx\n", ipcPtr, rel_mask);
    Cy_IPC_Drv_ReleaseNotify(ipcPtr, rel_mask);
    BTIPC_LOG_L1("Release register 0x%lx\n", ipcPtr->RELEASE);
    return CY_BT_IPC_DRV_SUCCESS;
}


cy_en_btipcdrv_status_t Cy_BTIPC_HCI_RelBuffer(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t* msgPtr)
{
    cy_stc_ipc_msg_alloc_t ipcMsgAlloc;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;
    uint8_t found;
    uint32_t interruptState;
    uint32_t *pMsg;

    if ((NULL == contextPtr) || (NULL == msgPtr))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    if (((cy_stc_ipc_msg_buff_t*)((void*)msgPtr))->pti != ((uint8_t)CY_BT_IPC_HCI_LONG))
    {
        /* Remove the FIFO entry */
        (void)Cy_BTIPC_HCI_FIFOGet(contextPtr, &pMsg, 1);
        return CY_BT_IPC_DRV_SUCCESS;
    }

    found = 0;

    interruptState = Cy_SysLib_EnterCriticalSection();

    /* If the channel is busy then do not proceed further, return CH BUSY error */
    if (Cy_IPC_Drv_IsLockAcquired (Cy_IPC_Drv_GetIpcBaseAddress(contextPtr->ulChannelHPC)))
    {
        Cy_SysLib_ExitCriticalSection(interruptState);
        return CY_BT_IPC_DRV_ERROR_CH_BUSY;
    }

    for (idx = 0U; idx < ((uint8_t)MAX_TO_FREE_BUF_COUNT); idx++)
    {
        if (contextPtr->toFreeBuf[idx].bufPtr == (uint8_t*)msgPtr[1])
        {
            ipcMsgAlloc.pti = (uint8_t)CY_BT_IPC_HPC_BUFRELEASE;
            ipcMsgAlloc.bufType = ((uint8_t)contextPtr->toFreeBuf[idx].bufType);
            ipcMsgAlloc.bufSize = contextPtr->toFreeBuf[idx].bufLen;
            ipcMsgAlloc.bufAddr = contextPtr->toFreeBuf[idx].bufPtr;
            found = 1;
            contextPtr->toFreeBuf[idx].bufType = CY_BT_IPC_HCI_INVALID_BUF;
            contextPtr->toFreeBuf[idx].bufLen = 0;
            contextPtr->toFreeBuf[idx].bufPtr = NULL;
            break;
        }
    }

    Cy_SysLib_ExitCriticalSection(interruptState);

    /* Remove the FIFO entry */
    (void)Cy_BTIPC_HCI_FIFOGet(contextPtr, &pMsg, 1);

    if (found != 0UL)
    {
#ifdef CY_BTIPC_STATS
        contextPtr->ipc_hci_peer_outbuf_count++;
#endif
        return (Cy_BTIPC_HPC_Write(contextPtr, &ipcMsgAlloc, (size_t) 2));
    }
    else
    {
        return CY_BT_IPC_DRV_ERROR_BUF_GET;
    }
}


cy_en_btipcdrv_status_t Cy_BTIPC_HPC_RelBuffer(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t* msgPtr)
{
    cy_stc_ipc_msg_alloc_t ipcMsgAlloc;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;

    if ((NULL == contextPtr) || (NULL == msgPtr))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    BTIPC_LOG_L1("Releasing HPC buffer 0x%lx\n", msgPtr[1]);
#ifdef CY_BTIPC_STATS
    contextPtr->ipc_hpc_peer_outbuf_count++;
#endif
    ipcMsgAlloc.pti = (uint8_t)CY_BT_IPC_HPC_BUFRELEASE;
    ipcMsgAlloc.bufType = 0;
    ipcMsgAlloc.bufSize = 0;
    ipcMsgAlloc.bufAddr = (uint8_t*)msgPtr[1];

    return (Cy_BTIPC_HPC_Write(contextPtr, &ipcMsgAlloc, (size_t) 2));
}


void Cy_BTIPC_HPC_Notify(void *btIpcContext, uint32_t * msgPtr)
{
    cy_en_btipc_hpcpti_t pti;
    cy_stc_ipc_bt_context_t *contextPtr = (cy_stc_ipc_bt_context_t*) btIpcContext;
    if ((NULL == contextPtr) || (NULL == msgPtr))
    {
        return;
    }

    BTIPC_LOG_L1("Internal cb for HPC\n");

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_btipc_hpcpti_t enum.');
    pti = (cy_en_btipc_hpcpti_t)((0xFFUL) & msgPtr[0]);

    switch (pti)
    {
        case CY_BT_IPC_HPC_LONG:
            (void)Cy_bt_handle_hpclong_msg(contextPtr, msgPtr);
            break;
        case CY_BT_IPC_HPC_BUFPROVIDE:
            (void)Cy_bt_handle_buf_add(contextPtr, msgPtr);
            break;
        default:
            /* default invalid pti */
            break;
    }
}


cy_en_btipcdrv_status_t Cy_BTIPC_Init(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_config_t *btIpcConfig)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    cy_en_btipcdrv_status_t status;
    uint8_t idx;

    if ((NULL == contextPtr) || (NULL == btIpcConfig))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    contextPtr->dlChannelHCI = btIpcConfig->dlChannelHCI;
    contextPtr->ulChannelHCI = btIpcConfig->ulChannelHCI;

    contextPtr->dlChannelHPC = btIpcConfig->dlChannelHPC;
    contextPtr->ulChannelHPC = btIpcConfig->ulChannelHPC;

    contextPtr->intStuctureSelf = btIpcConfig->intStuctureSelf;
    contextPtr->intStucturePeer = btIpcConfig->intStucturePeer;
    contextPtr->intPeerMask = (uint32_t) (0x1UL << btIpcConfig->intStucturePeer);

    contextPtr->dlNotifyCallbackPtr = NULL;
    contextPtr->ulReleaseCallbackPtr = btIpcConfig->ulReleaseCallbackPtr;
    contextPtr->bufCallbackPtr = btIpcConfig->bufCallbackPtr;

    contextPtr->irqHandlerPtr = btIpcConfig->irqHandlerPtr;
    contextPtr->ipcIntConfig.intrSrc = btIpcConfig->ipcIntConfig.intrSrc;
    contextPtr->ipcIntConfig.intrPriority = btIpcConfig->ipcIntConfig.intrPriority;

    contextPtr->internal_hpc_notify_cb = btIpcConfig->internal_hpc_notify_cb;

    contextPtr->dlNotifyMask = (uint32_t)((uint32_t)(0x1UL << btIpcConfig->dlChannelHCI) | (uint32_t)(0x1UL << btIpcConfig->dlChannelHPC));
    contextPtr->ulReleaseMask = (uint32_t)((uint32_t)(0x1UL << btIpcConfig->ulChannelHCI) | (uint32_t)(0x1UL << btIpcConfig->ulChannelHPC));

    contextPtr->droppedHCI = 0;

