RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ipc_bt.c
    contextPtr->bootType = 0xFF;

    for (idx = 0U; idx <((uint8_t)MAX_BT_IPC_HPC_CB); idx++)
    {
        contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr = NULL;
        contextPtr->hpcNotifyCallbackParam[idx].msgType = CY_BT_IPC_HPC_RESERVED;
    }

    for (idx = 0U; idx < ((uint8_t)MAX_BUF_COUNT); idx++)
    {
        contextPtr->buffPool[idx].bufPtr = NULL;
        contextPtr->buffPool[idx].bufType = CY_BT_IPC_HCI_INVALID_BUF;
    }

    for (idx = 0U; idx < ((uint8_t)MAX_IPC_FIFO_SIZE); idx++)
    {
        contextPtr->IpcFifo.fifo[idx].msg[0] = 0;
        contextPtr->IpcFifo.fifo[idx].msg[1] = 0;
    }
    contextPtr->IpcFifo.rdIdx = 0;
    contextPtr->IpcFifo.wrIdx = 0;
    contextPtr->IpcFifo.bufLen = 0;

    for (idx = 0U; idx < ((uint8_t)MAX_TO_FREE_BUF_COUNT); idx++)
    {
        contextPtr->toFreeBuf[idx].bufPtr = NULL;
        contextPtr->toFreeBuf[idx].bufType = CY_BT_IPC_HCI_INVALID_BUF;
        contextPtr->toFreeBuf[idx].bufLen = 0;
    }

    status = Cy_BTIPC_WarmInit(contextPtr, btIpcConfig);

#ifdef CY_BTIPC_STATS
    contextPtr->ipc_int_count = 0;

    contextPtr->ipc_hci_cmd_count = 0;
    contextPtr->ipc_hpc_cmd_count = 0;

    contextPtr->ipc_hci_release_count = 0;
    contextPtr->ipc_hpc_release_count = 0;

    contextPtr->ipc_hci_notify_count = 0;
    contextPtr->ipc_hpc_notify_count = 0;

    contextPtr->ipc_hci_peer_release_count = 0;
    contextPtr->ipc_hpc_peer_release_count = 0;

    contextPtr->ipc_hci_peer_inbuf_count = 0;
    contextPtr->ipc_hci_peer_outbuf_count = 0;

    contextPtr->ipc_hpc_peer_inbuf_count = 0;
    contextPtr->ipc_hpc_peer_outbuf_count = 0;

    contextPtr->ipc_hci_cmd_self_outbuf_count = 0;
    contextPtr->ipc_hci_cmd_self_inbuf_count = 0;
    contextPtr->ipc_hci_cmd_self_outbuf_success = 0;

    contextPtr->ipc_hci_fifo_full = 0;
    contextPtr->ipc_hci_notify_in_fifo_full = 0;
#endif
    return status;
 }


cy_en_btipcdrv_status_t Cy_BTIPC_WarmInit(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_config_t *btIpcConfig)
{
    cy_en_sysint_status_t intrStatus;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;

    if ((NULL == contextPtr) || (NULL == btIpcConfig))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    intrStatus = Cy_SysInt_Init(&contextPtr->ipcIntConfig, contextPtr->irqHandlerPtr);
    if (((uint32_t)intrStatus) != 0UL)
    {
        return CY_BT_IPC_DRV_ERROR;
    }

    /* enable interrupt */
    NVIC_EnableIRQ(contextPtr->ipcIntConfig.intrSrc);

    /* Set IPC Interrupt mask */
    /* Allow only notify on DL channel  and release on UL channel interrupts */
    Cy_IPC_Drv_SetInterruptMask(Cy_IPC_Drv_GetIntrBaseAddr(contextPtr->intStuctureSelf), contextPtr->ulReleaseMask, contextPtr->dlNotifyMask);
    return CY_BT_IPC_DRV_SUCCESS;
 }


cy_en_btipcdrv_status_t Cy_BTIPC_Deinit(cy_stc_ipc_bt_context_t *btIpcContext)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;

    if (NULL == contextPtr)
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    /* enable interrupt */
    NVIC_DisableIRQ(contextPtr->ipcIntConfig.intrSrc);

    contextPtr->irqHandlerPtr = NULL;
    contextPtr->internal_hpc_notify_cb = NULL;

    for (idx = 0; idx < ((uint8_t)MAX_BT_IPC_HPC_CB); idx++)
    {
        contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr = NULL;
        contextPtr->hpcNotifyCallbackParam[idx].msgType = CY_BT_IPC_HPC_RESERVED;
    }

    for (idx = 0U; idx < ((uint8_t)MAX_BUF_COUNT); idx++)
    {
        contextPtr->buffPool[idx].bufPtr = NULL;
        contextPtr->buffPool[idx].bufType = CY_BT_IPC_HCI_INVALID_BUF;
    }

    return CY_BT_IPC_DRV_SUCCESS;
}


CY_IPC_SECTION_BEGIN
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_getPTI (cy_en_btipc_hcipti_t *pti, uint32_t *p_length, uint32_t *msgPtr)
{
    cy_stc_ipc_msg_buff_t *ipcMsgBuf;
    uint8_t *bufAddr;
    cy_en_btipc_hcipti_t mesgPti;

    if ((NULL == pti) || (NULL == msgPtr) || (NULL == p_length))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    /* Incase of long messages the PTI needs to be read from DATA0[bit 8-15] */
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_btipc_hcipti_t enum');
    mesgPti = (cy_en_btipc_hcipti_t)((0xFFUL) & msgPtr[0]);
    if (mesgPti == CY_BT_IPC_HCI_LONG)
    {
        ipcMsgBuf = (cy_stc_ipc_msg_buff_t*)((void*)msgPtr);
        *pti = (cy_en_btipc_hcipti_t)ipcMsgBuf->actualPti;
        bufAddr = ipcMsgBuf->bufAddr;
        /* Mapping of BT address space to MCU address space */
#if defined(BT_IPC_SIM) || !defined (BTSS)
        bufAddr = (uint8_t*)bufAddr;
#else
        bufAddr = (uint8_t*)((uint32_t)(bufAddr) + ((uint32_t)BTSS_DATA_RAM_IPC - 0x28000000UL));
#endif

        if (Cy_bt_isOffsetNeeded(*pti))
        {
            bufAddr++;
        }
    }
    else
    {
        *pti = mesgPti;
        bufAddr = (uint8_t*)msgPtr;
        /* Skip the PTI byte read from the DATA0 register */
        bufAddr++;
    }
    *p_length = Cy_bt_getPLLegnth(*pti, bufAddr);
    return CY_BT_IPC_DRV_SUCCESS;
}
CY_IPC_SECTION_END

CY_IPC_SECTION_BEGIN
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_GetReadBufPtr (cy_stc_ipc_bt_context_t *btIpcContext, void **ppData, size_t* pLength)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    cy_stc_ipc_msg_buff_t *ipcMsgBuf;
    cy_stc_ipc_msg_short_t *shortMesg;
    cy_en_btipc_hcipti_t actualPti;
    cy_en_btipc_hcipti_t mesgPti;
    cy_en_btipcdrv_status_t status;
    uint32_t *pMsg;
    uint8_t *srcPtr;
    uint8_t idx;
    uint8_t done;
    uint32_t interruptState;

    if ((NULL == contextPtr) || (NULL == ppData))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    status = Cy_BTIPC_HCI_FIFOGet(contextPtr, &pMsg, 0);

    if (((uint32_t)status) != 0UL)
    {
        return status;
    }

    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_btipc_hcipti_t enum.');
    mesgPti = (cy_en_btipc_hcipti_t)((0xFFUL) & pMsg[0]);

    if (mesgPti == CY_BT_IPC_HCI_LONG)
    {
        ipcMsgBuf = (cy_stc_ipc_msg_buff_t*)((void*)pMsg);
        actualPti = (cy_en_btipc_hcipti_t)ipcMsgBuf->actualPti;
        srcPtr = ipcMsgBuf->bufAddr;
        /* Mapping of BT address space to MCU address space */
#if defined(BT_IPC_SIM) || !defined (BTSS)
        srcPtr = (uint8_t*)(srcPtr);
#else
        srcPtr = (uint8_t*)((uint32_t)(srcPtr) + ((uint32_t)BTSS_DATA_RAM_IPC - 0x28000000UL));
#endif
#ifdef CY_BTIPC_STATS
        contextPtr->ipc_hci_peer_inbuf_count++;
#endif
        if (Cy_bt_isOffsetNeeded(actualPti))
        {
            srcPtr++;
        }
        *pLength = Cy_bt_getPLLegnth(actualPti, srcPtr);

