RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ipc_bt.c
cy_en_btipcdrv_status_t Cy_BTIPC_HCI_UnregisterCb(cy_stc_ipc_bt_context_t *btIpcContext)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;

    if (NULL == contextPtr)
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    contextPtr->dlNotifyCallbackPtr = NULL;

    return CY_BT_IPC_DRV_SUCCESS;
}


cy_en_btipcdrv_status_t Cy_BTIPC_HPC_RegisterCb(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_hcp_cb_t *pHpcNotifyCallbackParam)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;
    uint8_t placed;

    if ((NULL == contextPtr) || (NULL == pHpcNotifyCallbackParam))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    placed = 0U;
    for (idx = 0U; idx < ((uint8_t)MAX_BT_IPC_HPC_CB); idx++)
    {
        if ((contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr == NULL) &&
            (contextPtr->hpcNotifyCallbackParam[idx].msgType == CY_BT_IPC_HPC_RESERVED))
        {
            contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr = pHpcNotifyCallbackParam->hpcNotifyCallbackPtr;
            contextPtr->hpcNotifyCallbackParam[idx].msgType = pHpcNotifyCallbackParam->msgType;
            placed = 1;
            break;
        }
    }

    if (placed != 0U)
    {
        return CY_BT_IPC_DRV_SUCCESS;
    }
    else
    {
        return CY_BT_IPC_DRV_ERROR;
    }
}


cy_en_btipcdrv_status_t Cy_BTIPC_HPC_UnregisterCb(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_hcp_cb_t *pHpcNotifyCallbackParam)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;
    uint8_t found;

    if ((NULL == contextPtr) || (NULL == pHpcNotifyCallbackParam))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    found = 0;
    for (idx = 0U; idx < ((uint8_t)MAX_BT_IPC_HPC_CB); idx++)
    {
        if ((contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr == pHpcNotifyCallbackParam->hpcNotifyCallbackPtr) &&
            (contextPtr->hpcNotifyCallbackParam[idx].msgType == pHpcNotifyCallbackParam->msgType))
        {
            contextPtr->hpcNotifyCallbackParam[idx].hpcNotifyCallbackPtr = NULL;
            contextPtr->hpcNotifyCallbackParam[idx].msgType = CY_BT_IPC_HPC_RESERVED;
            found = 1;
            break;
        }
    }

    if (found != 0UL)
    {
        return CY_BT_IPC_DRV_SUCCESS;
    }
    else
    {
        return CY_BT_IPC_DRV_ERROR;
    }
}


cy_en_btipcdrv_status_t Cy_BTIPC_Buffer_RegisterCb(cy_stc_ipc_bt_context_t *btIpcContext, cy_ipc_bt_bufcallback_ptr_t bufCallbackPtr)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint32_t interruptState;

    if ((NULL == contextPtr) || (NULL == bufCallbackPtr))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    interruptState = Cy_SysLib_EnterCriticalSection();
    contextPtr->bufCallbackPtr = bufCallbackPtr;
    Cy_SysLib_ExitCriticalSection(interruptState);

    return CY_BT_IPC_DRV_SUCCESS;
}


CY_IPC_SECTION_BEGIN
static cy_en_btipcdrv_status_t Cy_bt_GetBuffer (cy_stc_ipc_bt_context_t *btIpcContext, void **ppBuf, cy_en_btipc_buftype_t bufType, size_t length)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;
    uint8_t found;
    uint8_t size_error;
    uint32_t interruptState;

    if ((NULL == contextPtr) || (NULL == ppBuf))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    interruptState = Cy_SysLib_EnterCriticalSection();

    found = 0;
    size_error = 0;

    BTIPC_LOG_L2("Buf req: Type 0x%x, Size %d\n",bufType,length);
    BTIPC_LOG_L2("Buf Pool content\n");

#ifdef CY_BTIPC_STATS
    if (bufType == CY_BT_IPC_HCI_CMD_BUF)
    {
        contextPtr->ipc_hci_cmd_self_outbuf_count++;
    }
#endif
    for (idx = 0U; idx < ((uint8_t)MAX_BUF_COUNT); idx++)
    {
        BTIPC_LOG_L2("idx %d, bufType 0x%x, bufLen %d, bufPtr %p\n",idx, contextPtr->buffPool[idx].bufType,contextPtr->buffPool[idx].bufLen, contextPtr->buffPool[idx].bufPtr);

        if ((contextPtr->buffPool[idx].bufType == bufType) && (contextPtr->buffPool[idx].bufPtr != NULL))
        {
            if (length <= contextPtr->buffPool[idx].bufLen)
            {
                *ppBuf = (void*)contextPtr->buffPool[idx].bufPtr;
                // Mapping of address
#if defined(BT_IPC_SIM) || !defined (BTSS)
                *ppBuf = (void*)(*ppBuf);
#else
                *ppBuf = (void*)((uint32_t)(*ppBuf) + ((uint32_t)BTSS_DATA_RAM_IPC - 0x28000000UL));
#endif
                contextPtr->buffPool[idx].bufPtr = NULL;
                contextPtr->buffPool[idx].bufType = CY_BT_IPC_HCI_INVALID_BUF;
                found = 1;
#ifdef CY_BTIPC_STATS
                if (bufType == CY_BT_IPC_HCI_CMD_BUF)
                {
                   contextPtr->ipc_hci_cmd_self_outbuf_success++;
                }
#endif
                break;
            }
            else
            {
                size_error = 1;
            }
        }
    }

    Cy_SysLib_ExitCriticalSection(interruptState);

    if (found != 0UL)
    {
        return CY_BT_IPC_DRV_SUCCESS;
    }
    else if (size_error == 1UL)
    {
        return CY_BT_IPC_DRV_ERROR_BUF_SIZE;
    }
    else
    {
        *ppBuf = NULL;
        return CY_BT_IPC_DRV_ERROR_BUF_GET;
    }

}
CY_IPC_SECTION_END

static cy_en_btipcdrv_status_t Cy_bt_PutBuffer(cy_stc_ipc_bt_context_t *btIpcContext, cy_stc_ipc_bt_buf_t *bufDecriptor)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    uint8_t idx;
    uint32_t interruptState;
    cy_en_btipcdrv_status_t status = CY_BT_IPC_DRV_ERROR_BUF_FULL;

    BTIPC_LOG_L2("Put buffer+\n");

    if ((NULL == contextPtr) || (NULL == bufDecriptor) || (bufDecriptor->bufPtr == NULL))
    {
        BTIPC_LOG_L2("Put buffer-\n");
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    interruptState = Cy_SysLib_EnterCriticalSection();

    for (idx = 0U; idx < ((uint8_t)MAX_BUF_COUNT); idx++)
    {
        if ((contextPtr->buffPool[idx].bufType == bufDecriptor->bufType) &&
            (contextPtr->buffPool[idx].bufPtr == bufDecriptor->bufPtr))
        {
            BTIPC_LOG_L2("Buffer already present in the pool at %d\n",idx);
            status = CY_BT_IPC_DRV_ERROR_BUF_PRESENT;
            break;
        }
        else if (contextPtr->buffPool[idx].bufType == CY_BT_IPC_HCI_INVALID_BUF)
        {
            contextPtr->buffPool[idx] = *bufDecriptor;
            status = CY_BT_IPC_DRV_SUCCESS;
            BTIPC_LOG_L2("Added buffer at index %d\n",idx);
            break;
        }
        else
        {
            /* This is just to keep coverity happy */
        }
    }

    Cy_SysLib_ExitCriticalSection(interruptState);

