RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_ipc_bt.c
    /* Call handler for buffer */
    if ((status == CY_BT_IPC_DRV_SUCCESS) && (NULL != contextPtr->bufCallbackPtr))
    {
        contextPtr->bufCallbackPtr(bufDecriptor->bufType);
    }

    BTIPC_LOG_L2("Put buffer-\n");
    return status;
}


/* Local function implementation */
cy_en_btipcdrv_status_t Cy_bt_handle_hpclong_msg(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t * msgPtr)
{
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    cy_stc_ipc_msg_init_t *ptr;
    cy_stc_ipc_bt_buf_t bufDescriptor;
    cy_en_btipcdrv_status_t status;
    uint8_t i;
    uint8_t bufCount;
    uint8_t *bPtr;
    uint8_t *bDptr;
    cy_en_btipc_hpcmsgid_t longMsgType;
    uint8_t idx;

    if ((NULL == contextPtr) || (NULL == msgPtr))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    bPtr = (uint8_t*)msgPtr;
    longMsgType = (cy_en_btipc_hpcmsgid_t)(*(bPtr+1));

    BTIPC_LOG_L1("longMsgType %d\n", longMsgType);

    status = CY_BT_IPC_DRV_SUCCESS;
#ifdef CY_BTIPC_STATS
    contextPtr->ipc_hpc_peer_inbuf_count++;
#endif
    switch (longMsgType)
    {
        case CY_BT_IPC_HPC_INIT:
            ptr = (cy_stc_ipc_msg_init_t*)(* (msgPtr+1));
            if (NULL == ptr)
            {
                status = CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
                break;
            }
            /* mapping of memory */
#if defined(BT_IPC_SIM) || !defined (BTSS)
            ptr = (cy_stc_ipc_msg_init_t*)(ptr);
#else
            ptr = (cy_stc_ipc_msg_init_t*)((uint32)ptr + ((uint32_t)BTSS_DATA_RAM_IPC - 0x28000000UL));
#endif
            /* The payloadLen includes bootype (1 byte) and error code (4 bytes).
            Hence, subtract INIT_IPC_BUFF_DESC_OFFSET (5 Bytes) from it */
            bufCount = (ptr->payLoadLen - (uint8_t)INIT_IPC_BUFF_DESC_OFFSET)/((uint8_t)BUFFER_DESCRIPTION_LEN);

            /* Add code to extract boot type from init structure */
            contextPtr->bootType = ptr->bootType;
#ifndef BT_OLD_INIT
            bPtr = (uint8_t*)(&ptr->bootType);
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 18.1','Checked manually, the byte pointer will not corrupt memory.');
            bPtr++;
            bDptr = (uint8_t*)(&contextPtr->certError);
            CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 18.1','Checked manually, the byte pointer will not corrupt memory.');
            *bDptr++ = *bPtr++;
            *bDptr++ = *bPtr++;
            *bDptr++ = *bPtr++;
            *bDptr++ = *bPtr++;
#endif

#ifdef BT_OLD_INIT
            BTIPC_LOG_L0("handling Init mesg from %p, boottype %d, payload len 0x%x, bufCount %d\n",
                ptr, ptr->bootType, ptr->payLoadLen, bufCount);
#else
            BTIPC_LOG_L0("handling Init mesg from %p, boottype %d, payload len 0x%x, certError 0x%lx bufCount %d\n",
                ptr, ptr->bootType, ptr->payLoadLen, contextPtr->certError , bufCount);
#endif


            if ((ptr->bootType == (uint8_t)CY_BT_IPC_BOOT_CONFIG_WAIT) ||
                (ptr->bootType == (uint8_t)CY_BT_IPC_BOOT_FULLY_UP))
            {

                /* Clear all buffers in the pool */
                for (idx = 0U; idx < ((uint8_t)MAX_BUF_COUNT); idx++)
                {
                    contextPtr->buffPool[idx].bufPtr = NULL;
                    contextPtr->buffPool[idx].bufType = CY_BT_IPC_HCI_INVALID_BUF;
                }

                //msgId
                //bootType
                /* point to the start of buffer pool */
                bPtr = (uint8_t*)ptr + sizeof(cy_stc_ipc_msg_init_t);

                BTIPC_LOG_L0("\nExtract buffers from %p\n",bPtr);

                for (i = 0; i < bufCount; i++)
                {
                    bufDescriptor.bufType = (cy_en_btipc_buftype_t) (*bPtr++);

                    bDptr = (uint8_t*)(&bufDescriptor.bufLen);
                    *bDptr++ = *bPtr++;
                    *bDptr++ = *bPtr++;

                    bDptr = (uint8_t*)(&bufDescriptor.bufPtr);
                    *bDptr++ = *bPtr++;
                    *bDptr++ = *bPtr++;
                    *bDptr++ = *bPtr++;
                    *bDptr++ = *bPtr++;

                    BTIPC_LOG_L0("bufType %x, bufLen %d, bufPtr %p\n",bufDescriptor.bufType, bufDescriptor.bufLen, bufDescriptor.bufPtr);

                    status = Cy_bt_PutBuffer(contextPtr, &bufDescriptor);
                    if (((uint32_t)status) != 0UL)
                    {
                        /* Need to check if some cleaning needed for error condition */
                        BTIPC_LOG_L0("Error in putting the buffer to pool\n");
                    }
                    else
                    {
                        BTIPC_LOG_L0("Added buf %d\n",i);
                    }
                }
                BTIPC_LOG_L0("Bufs add done\n\n");
            }
            else
            {
                BTIPC_LOG_L0("\nInvalid Boot type\n");
            }
            break;

        case CY_BT_IPC_HPC_HADM:
            BTIPC_LOG_L1("HADM Data\n");
            /* Add code to handle HADM data */
            break;

        default:
            /* Invalid long message type */
            status = CY_BT_IPC_DRV_ERROR_PARAM;
            break;
    }
    return status;
}


cy_en_btipcdrv_status_t Cy_bt_handle_buf_add(cy_stc_ipc_bt_context_t *btIpcContext, uint32_t * msgPtr)
{
    cy_stc_ipc_bt_buf_t bufDescriptor;
    cy_stc_ipc_msg_alloc_t allocBuf;
    cy_stc_ipc_bt_context_t *contextPtr = btIpcContext;
    cy_en_btipcdrv_status_t status;

    BTIPC_LOG_L2("Adding buf\n");

    if ((NULL == contextPtr) || (NULL == msgPtr))
    {
        return CY_BT_IPC_DRV_ERROR_BAD_HANDLE;
    }

    allocBuf = *(cy_stc_ipc_msg_alloc_t*)((void*)msgPtr);
    bufDescriptor.bufType = (cy_en_btipc_buftype_t) allocBuf.bufType;
    bufDescriptor.bufLen = allocBuf.bufSize;
    bufDescriptor.bufPtr = (uint8_t*) allocBuf.bufAddr;

    BTIPC_LOG_L2("bufType 0x%x, bufLen 0x%x, bufPtr %p\n",bufDescriptor.bufType, bufDescriptor.bufLen, bufDescriptor.bufPtr);
#ifdef CY_BTIPC_STATS
    if (bufDescriptor.bufType == CY_BT_IPC_HCI_CMD_BUF)
    {
        contextPtr->ipc_hci_cmd_self_inbuf_count++;
    }
#endif
    status = Cy_bt_PutBuffer(contextPtr, &bufDescriptor);
    if (((uint32_t)status) != 0UL)
    {
        /* Need to check if some cleaning needed for error condition */
        BTIPC_LOG_L0("Error: 0x%x in putting the buffer to pool\n",status);
    }
    return status;
}


